a = ['ả', 'Ả', 'ằ', 'Ằ', 'ẳ', 'Ẳ', 'ẵ', 'Ẵ', 'ắ', 'Ắ', 'ẩ', 'Ẩ', 'ẫ', 'Ẫ', 'ấ', 'Ấ', 'ậ', 'Ậ', 'ạ', 'Ạ']
b = ['Ḃ', 'ḃ', 'Ḅ', 'ḅ', 'Ḇ', 'ḇ', 'Ƀ', 'ƀ', 'ᵬ', 'ᶀ', 'Ɓ', 'ɓ', 'Ƃ', 'ƃ', 'β']
c = ['ç', 'Ç', 'č', 'Č', 'ĉ', 'Ĉ', 'ć', 'Ć', 'ḉ', 'Ḉ', 'Ċ', 'c̄', 'C̄', 'ȼ', 'Ȼ', 'ꞓ', 'Ꞓ']
e = ['е', 'Е', 'ё', 'Ё', 'э', 'Э', 'ѐ', 'Ѐ', 'є', 'Є',]
l = ['Ł', 'ł', 'Ƚ', 'ƚ', 'ꝉ', 'l̥', 'ĺ', 'Ĺ', 'Ľ', 'ḹ', 'Ḹ', 'ḷ', 'Ḷ', 'ľ']
o = ['ỏ', 'Ỏ', 'ô', 'Ô', 'ồ', 'Ồ', 'ổ', 'Ổ', 'ỗ', 'Ỗ', 'ố', 'Ố', 'ộ', 'Ộ', 'ơ', 'ợ', 'ọ', 'Ọ', 'ọ̀']
r = ['ʀ', 'Я', 'я', 'я́', 'ғ', 'ŕ', 'Ř', 'ř', 'ȑ', 'ȓ', 'ɼ', 'ɽ', 'ɾ', 'ṙ', 'ṛ', 'ṝ', 'ṟ', 'r̃']
s = ['Ş', 'ş', 'Ŝ', 'ŝ', 'ș', 'Ṩ', 'ṩ', 'Ṥ', 'ṥ', 'Ṡ', 'ṡ', 'Ṧ', 'ṧ', 'Š', 'š', 'Ś', 'ś', 'ṣ']
z = ['ⲍ', 'Ⲍ', 'ž', 'Ž', 'ż', 'Ż', 'Ẓ', 'ẓ', 'ź', 'Ẕ', 'ẕ', 'Ẑ', 'ẑ', 'Ź', 'ʐ', 'ʑ', 'ȥ', 'Ƶ', 'ƶ']


import random

string = input('Enter text: ')
string = string.lower()
string = list(string)

new_string = []
for char in string:
    if char == ' ':
        new_string.append(' ')
    else:
        new_string.append(random.choice(eval(char)))

new_string = ''.join(new_string)
print(new_string)


